CREATE DATABASE blog;
USE blog;

# 用户信息表
CREATE TABLE `user` (
	`uid` INT(10) AUTO_INCREMENT COMMENT '用户ID',
	`uname` VARCHAR(32) COMMENT '用户名称',
	`password` VARCHAR(32) COMMENT '密码',
	`tel` VARCHAR(32) COMMENT '电话号码',
	`email` VARCHAR(64) COMMENT '电子邮箱',
	PRIMARY KEY(`uid`)
);

INSERT INTO `user` VALUES
(NULL, '叶伊颜', 'yyy123', '13300948223', 'yyy123@163.com'),
(NULL, '余楚洁', 'yzj123', '17747227272', 'yzj123@163.com'),
(NULL, '姚学义', 'yxy123', '19983726662', 'yxy123@163.com'),
(NULL, '朱鸿信', 'zhx123', '13344252633', 'zhx123@163.com'),
(NULL, '杨飞翼', 'yfy123', '15566609442', 'yfy123@163.com'),
(NULL, '于君昊', 'yjh123', '14439922233', 'yjh123@163.com'),
(NULL, '杜和煦', 'dhx123', '19932233556', 'dhx123@163.com'),
(NULL, '罗温茂', 'lwm123', '18977362323', 'lwm123@163.com'),
(NULL, '董鹤轩', 'dhx123', '18823232132', 'dhx123@163.com'),
(NULL, '孔成化', 'kch123', '18737233777', 'kch123@163.com');


# 文章信息表
CREATE TABLE `article` (
	`aid` INT(10) AUTO_INCREMENT COMMENT '文章ID',
	`title` VARCHAR(128) COMMENT '文章标题',
	`author` VARCHAR(128) COMMENT '文章作者',
	`content` TEXT COMMENT '文章内容',
	`time` DATETIME COMMENT '发表时间',
	`type` INT(10) COMMENT '文章类型编号',
	PRIMARY KEY(`aid`)
);

SELECT * FROM user


# 1 新闻 2 旅游 3娱乐
INSERT INTO `article` VALUES
(NULL, '新闻有观点·行业洞察｜谁来稳住狂涨的中药材？', '央视网', '央广网北京7月9日消息 据中央广播电视总台中国之声《新闻有观点》报道，从身边的现象和变化出发，洞悉行业和经济的脉动；从行业的新闻和看点开始，洞悉社会和时代的变革。近期，中药材价格异常增长的情况引发各界关注，这是一次前所未有的价格暴涨吗？会带来怎样的影响？中药行业该如何破局？', '2023-07-09 18:09', 1),
(NULL, '临走前，耶伦在京表态', '观察者网', '美国财政部长耶伦9日结束4天访华行程，在北京召开发布会总结本次访问。耶伦说，尽管美中之间分歧犹存，但近几天的会晤已进一步推动双边关系重返稳定轨道。她再度重申，美国不寻求与中国经济“脱钩”。综合路透社、法新社等报道，耶伦在发布会上称，她此访与中方官员进行了累计约10个小时双边会谈，这些对话“直接、有实质', '2023-07-09 17:17', 1),
(NULL, '高温"烤"验持续！杭州人都在这里避暑！出梅也有消息了', '杭州综合频道','炎炎夏日，大家都喜欢待在凉快的地方，但很多人又不喜欢一直吹着空调，该怎么办？今天就给大家推荐一处 杭州老底子的避暑胜地—— 玉皇山紫来洞。眼下，那里已经热闹了起来。', '2023-07-09 19:59', 2),
(NULL, '动物奇幻夜来了！东莞香市动物园暑期上演精彩大戏 ', '羊城派','亲身体验傣族泼水狂欢节、奇幻夜探索动物王国奥秘……这个暑期，来东莞这个景点打卡点，定会给暑期生活留下难忘记忆。记者7月9日记者从东莞香市动物园获悉，傣族泼水狂欢节动物奇幻夜系列活动已正式开启，7月1日-8月31日，系列精彩大戏都在香市动物园激情上演。', '2023-07-09 21:00', 2),
(NULL, '热度不高，但口碑“炸裂”的5部悬疑剧，你若一部没看太遗憾！', '圆头讲电影', '剧情点评：整体来说剧集非常用心，作为从小爱看聊斋等志怪类题材的人真的很满意现在有这种剧，可惜不能有真正的花妖狐鬼，基本是古代版《扫黑风暴》和《破冰行动》。主演基本合适，不会太出戏，分工也不错，男性服装和置景都很用心，武器种类多样', '2023-07-09 11:15', 3),
(NULL, '《茶啊二中》举办首映礼 乔杉女儿点赞影片好看', '1905电影网', '7月8日晚，动画电影举办首映礼。导演、，制片人邢原源到场，参与影片映后交流活动。首映礼现场，也汇集了、、、、陈寥宇、等明星观众。该片由同名IP网剧改编而成，讲述了一位学生与老师之间因为意外灵魂互换，并由此展开的一系列啼笑皆非的故事。', '2023-07-09 13:07', 3);

# 评论信息表
CREATE TABLE `comment` (
	`cid` INT(10) AUTO_INCREMENT COMMENT '评论ID',
	`content` VARCHAR(512) COMMENT '评论内容',
	`time` DATETIME COMMENT '评论时间',
	`aid` INT(10) COMMENT '`article`（文章信息表）外键',
	`uid` INT(10) COMMENT '`user`（用户信息表）外键',
	PRIMARY KEY(`cid`),
	# `article`（文章信息表）外键
	FOREIGN KEY(`aid`) REFERENCES `article`(`aid`),
	# `user`（用户信息表）外键
	FOREIGN KEY(`uid`) REFERENCES `user`(`uid`)
);

INSERT INTO `comment` VALUES
(NULL, '文章紧跟实事，分析完整。很不错！', NOW(), 1, 1),
(NULL, '文章很不错！', NOW(),2, 1),
(NULL, '感谢对景点的分享，很赞！', NOW(), 3, 2),
(NULL, '分析完整。很不错！', NOW(), 4, 6),
(NULL, '该用户暂无评论', NOW(), 5, 3),
(NULL, '很不错！', NOW(), 6, 5),
(NULL, '分析完整。很不错！', NOW(), 7, 4),
(NULL, '不错不错！', NOW(), 8, 3),
(NULL, '还行', NOW(), 9, 3),
(NULL, '很不错！', NOW(), 10, 1);


